
import Header from '../header/Header.js';
import Article from '../article/Article.js';
import Footer from '../footer/Footer.js';
import Nav from '../nav/Nav.js'
import './App.css'

function App(props) {
  return (
    <div className="App">
      <Header />
      <Nav navigation={props.navigation} />
      <Article/>
      <Article title="Cовременные десктопные процессоры архитектуры x86" content=" */}
                 Этот материал представляет собой обновлённую, существенно переработанную и дополненную версию статьи 2006 года, которая называлась «Современные десктопные процессоры архитектуры x86: общие принципы работы (x86 CPU FAQ 1.0)». Правда, чтобы не вводить потенциальных читателей в заблуждение словом «FAQ», мы решили назвать новый материал более правильным, как нам кажется, термином — «дайджест». Действительно, ведь большая его часть — это не ответы на конкретные вопросы, а разъяснения и краткие выжимки из чего угодно — от технической документации до истории развития микропроцессорной отрасли. Для кого предназначен данный материал? Нам видятся две группы потенциальных читателей. */}
                 <em>Первая</em> — это те, кто вдруг обнаружил, что ему действительно интересно узнать, как работает современный x86-процессор. Для них мы попытались сосредоточить в рамках статьи максимальное количество полезных сведений, которые позволяют получить более-менее полное представление об этом процессе, даже не имея до этого (почти) никаких специальных знаний: здесь объясняется значение основных терминов, устройство современных CPU, принципы взаимодействия различных их составляющих между собой, а также процессора с компьютерной системой в целом. */}
            
                 <b>Вторая группа</b> — это те, кто не найдёт в статье почти ничего нового для себя — но им попросту лень писать нечто похожее самостоятельно, чтобы сосредоточить разбросанные по мозгу знания в одном месте, «причесать» их, систематизировать, упорядочить, осовременить, и так далее. Мы сами отлично понимаем, как бывает лениво писать конспекты :) (а особенно — хорошие конспекты), поэтому если наш дайджест вас устраивает — мы с радостью дарим вам возможность им пользоваться. */}
                 Ну и традиционное предупреждение: если иное не указано явно, то слово «процессор» в данном материале обозначает «x86(-64) процессор, предназначенный для установки в десктопы или (намного реже) мобильные компьютеры». Серверные процессоры, специализированные процессоры с архитектурой x86, всевозможные embedded-варианты — всё это в рамках статьи не рассматривается */}

                 Lorem ipsum dolor sit amet consectetur adipisicing elit. Tenetur, mollitia officia. Repudiandae fugiat nobis in expedita maiores odio eveniet quidem tempora quibusdam nam iste neque molestiae, excepturi, unde adipisci mollitia? 
              "/>
      <Footer />
    </div>
  );
}

export default App;
